# Casks — GUI apps
cask "alfred"
cask "backblaze"
cask "charles"
cask "chatgpt"
cask "claude"
cask "codex"
cask "copilot-cli"
cask "cursor"
cask "docker-desktop"
cask "expressvpn"
cask "fantastical"
cask "figma"
cask "flux-app"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "licecap"
cask "ngrok"
cask "obsidian"
cask "openvpn-connect"
cask "proxyman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "wispr-flow"

# Brews — CLI tools
brew "awscli"
brew "ffmpeg"
brew "flyway"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gradle"
brew "grep"
brew "httpie"
brew "jd"
brew "jq"
brew "just"
brew "k6"
brew "mas"
brew "nodenv"
brew "ollama"
brew "openjdk@11"
brew "openssh"
brew "pipx"
brew "postgresql@17"
brew "redis"
brew "ripgrep"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "vim"
brew "websocat"
brew "wget"
brew "yarn"
brew "zsh"

# Mac App Store
mas "1Password", id: 1333542190
mas "WhatsApp",  id: 310633997
mas "Things 3",  id: 904280696
mas "Bear",      id: 1091189122
mas "Harvest",   id: 506189836
mas "Slack",     id: 803453959
mas "Spark",     id: 6445813049
mas "Keynote",   id: 409183694
