cask "google-chrome"
cask "flux"
cask "charles"
cask "spotify"
cask "visual-studio-code"
cask "fantastical"
cask "intellij-idea-ce"
cask "docker"
cask "rectangle"
cask "microsoft-teams"
cask "iterm2"
cask "figma"
cask "openvpn-connect"
cask "visual-studio-code"
cask "messenger"
cask "backblaze"
cask "alfred"

brew "flyway"
brew "just"
brew "mas"
brew "wget"
brew "vim"
brew "tmux"
brew "tmuxinator"
brew "nodeenv"
brew "zsh"
brew "nodenv"
brew "grep"
brew "openssh"
brew "httpie"
brew "jq"
brew "git"
brew "git-lfs"
brew "gradle"
brew "python"
brew "hub"
brew "git-extras"
brew "awscli"
brew "docker-compose"
brew "postgresql@14"
brew "redis"
brew "java11"

mas "1Password", id: 1333542190
mas "WhatsApp Desktop", id: 310633997
mas "Things 3", id: 904280696
mas "Bear - Markdown Notes", id: 1091189122
mas "Harvest", id: 506189836
mas "Slack", id: 803453959
mas "Spark", id: 6445813049
/* mas "Fantastical", id: 975937182 */
mas "Microsoft To Do", id: 1274495053
