tap "homebrew/cask"
cask_args appdir: "/Applications"

cask "google-chrome"

brew "wget"
brew "vim"
brew "tmux"
brew "zsh"
brew "grep"
brew "openssh"
brew "trash"
brew "httpie"
brew "jq"
brew "the_silver_searcher"
brew "trash"
brew "git"
brew "git-lfs"
brew "gradle"
brew "python"
brew "python-3"
brew "hub"
brew "git-extras"
brew "awscli"
brew "docker"
brew "docker-machine"
brew "docker-compose"
brew "postgresql"
brew "redis"

mas "1Password", id: 443987910
