tap "homebrew/cask"
cask_args appdir: "/Applications"

cask "google-chrome"
cask "flux"
cask "charles"
cask "spotify"
cask "visual-studio-code"
cask "fantastical"
cask "intellij-idea-ce"
cask "spectacle"
cask "docker"
cask "microsoft-teams"
cask "iterm2"

brew "mas"
brew "wget"
brew "vim"
brew "tmux"
brew "tmuxinator"
brew "nodeenv"
brew "zsh"
brew "nodenv"
brew "grep"
brew "openssh"
brew "httpie"
brew "jq"
brew "git"
brew "git-lfs"
brew "gradle"
brew "python"
brew "hub"
brew "git-extras"
brew "awscli"
brew "docker-compose"
brew "postgresql"
brew "redis"
brew "java11"

mas "Spark", id: 1176895641
mas "1Password", id: 1333542190
mas "WhatsApp Desktop", id: 1147396723
mas "Things 3", id: 904280696
mas "Bear - Markdown Notes", id: 1091189122
mas "Harvest", id: 506189836
mas "Slack", id: 803453959
